<a href="https://colab.research.google.com/github/urness/CS167Fall22Code/blob/main/Day06_Notes_normalization_solution.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Day 06 Notes: Missing Data and Normalization

## Missing Data Handling

In [ ]:
import pandas
import numpy
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
#import the data and take a look at it
#You'll have to change this file path to get this line to work
titanic = pandas.read_csv('/content/drive/MyDrive/CS167Spring22/datasets/titanic.csv')
titanic.isna() #this returns a boolean that is True if data is NaN

     survived  pclass    sex    age  ...   deck  embark_town  alive  alone
0       False   False  False  False  ...   True        False  False  False
1       False   False  False  False  ...  False        False  False  False
2       False   False  False  False  ...   True        False  False  False
3       False   False  False  False  ...  False        False  False  False
4       False   False  False  False  ...   True        False  False  False
..        ...     ...    ...    ...  ...    ...          ...    ...    ...
886     False   False  False  False  ...   True        False  False  False
887     False   False  False  False  ...  False        False  False  False
888     False   False  False   True  ...   True        False  False  False
889     False   False  False  False  ...  False        False  False  False
890     False   False  False  False  ...   True        False  False  False

[891 rows x 15 columns]

In [ ]:
titanic.isna().any() #will return a list of columns and whether or not they have missing data

survived       False
pclass         False
sex            False
age             True
sibsp          False
parch          False
fare           False
embarked        True
class          False
who            False
adult_male     False
deck            True
embark_town     True
alive          False
alone          False
dtype: bool

### dropna()

In [ ]:
#drop rows only if age is null
print("before: ", titanic.shape)
cleaned_titanic = titanic.dropna(subset = ["age"]).copy() 
print("after: ", cleaned_titanic.shape)

before:  (891, 15)
after:  (714, 15)

In [ ]:
print("before: ", titanic.shape)
clean_titanic = titanic.dropna()
print("after: ", clean_titanic.shape)

before:  (891, 15)
after:  (182, 15)

In [ ]:
print("before: ", titanic.shape)
titanic.dropna(inplace=True)
print("after: ", clean_titanic.shape)

before:  (891, 15)
after:  (182, 15)

### fillna()

In [ ]:
# let's reload the data so that we have missing data again.
titanic = pandas.read_csv('/content/drive/MyDrive/CS167/datasets/titanic.csv')

#and fill the missing data this time.

print("before: ", titanic['age'].isna().any())
age_mean = titanic['age'].mean()
titanic['age'].fillna(age_mean, inplace=True)
print("after: ", titanic['age'].isna().any())
titanic.head(7)

before:  True
after:  False

   survived  pclass     sex        age  ...  deck  embark_town  alive  alone
0         0       3    male  22.000000  ...   NaN  Southampton     no  False
1         1       1  female  38.000000  ...     C    Cherbourg    yes  False
2         1       3  female  26.000000  ...   NaN  Southampton    yes   True
3         1       1  female  35.000000  ...     C  Southampton    yes  False
4         0       3    male  35.000000  ...   NaN  Southampton     no   True
5         0       3    male  29.699118  ...   NaN   Queenstown     no   True
6         0       1    male  54.000000  ...     E  Southampton     no   True

[7 rows x 15 columns]

### Programming Exercise #1
### Load in the dataset MoviesData.csv (the dataset used in Notebook #1)
1. What is the shape of the data frame?
2. Which of the columns have data that is missing?
3. Change all of the NaN values in the column IMDb to the average of column IMDb
4. Verify that the column no longer has any missing data.
5. Remove all rows that have NaN values in any of the other columns
6. What is the final shape?

In [ ]:
# Load in the dataset MoviesData.csv
movies = pandas.read_csv('/content/drive/MyDrive/CS167Spring22/datasets/MoviesData.csv')

In [ ]:
# 1. What is the shape of the data frame?
movies.shape

(16697, 9)

In [ ]:
#2. Which of the columns have data that is missing?
movies.isna().any()

Title              False
Year               False
Age                 True
IMDb                True
Rotten Tomatoes     True
Directors           True
Genre               True
Runtime             True
Country            False
dtype: bool

In [ ]:
# 3.Change all of the NaN values in the column IMDb to the average of column IMDb
average_IMDb = movies["IMDb"].mean()
movies["IMDb"].fillna(average_IMDb, inplace=True) 
### careful to do this only to the column "IMDb" and not to the entire data frame
# this is a mistake
# movies.fillna(average_IMDb, inplace=True)

In [ ]:
#4. Verify that the column no longer has any missing data.
print(movies['IMDb'].isna().any())

False

In [ ]:
movies.isna().any()

Title              False
Year               False
Age                 True
IMDb               False
Rotten Tomatoes     True
Directors           True
Genre               True
Runtime             True
Country            False
dtype: bool

In [ ]:
#5. Remove all rows that have NaN values in any of the other columns
clean_movies = movies.dropna()

In [ ]:
#6. What is the final shape?
clean_movies.shape

(3310, 9)

## Normalization Code

In [ ]:
titanic = pandas.read_csv('/content/drive/MyDrive/CS167/datasets/titanic.csv')
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [ ]:
#convert sex to numeric
titanic['sex'] = titanic['sex'].replace(to_replace='female', value=1)
titanic['sex'] = titanic['sex'].replace(to_replace='male', value=0)
titanic.head()

   survived  pclass  sex   age  ...  deck  embark_town  alive  alone
0         0       3    0  22.0  ...   NaN  Southampton     no  False
1         1       1    1  38.0  ...     C    Cherbourg    yes  False
2         1       3    1  26.0  ...   NaN  Southampton    yes   True
3         1       1    1  35.0  ...     C  Southampton    yes  False
4         0       3    0  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [ ]:
#gender
#calculate mean and std
s_mean = titanic['sex'].mean()
s_std = titanic['sex'].std()

#replace column with each entry's z-score
titanic['sex'] = (titanic["sex"] - s_mean)/s_std
titanic.head()

   survived  pclass       sex   age  ...  deck  embark_town  alive  alone
0         0       3 -0.737281  22.0  ...   NaN  Southampton     no  False
1         1       1  1.354813  38.0  ...     C    Cherbourg    yes  False
2         1       3  1.354813  26.0  ...   NaN  Southampton    yes   True
3         1       1  1.354813  35.0  ...     C  Southampton    yes  False
4         0       3 -0.737281  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [ ]:
#age
#calculate mean and std
a_mean = titanic['age'].mean()
a_std = titanic['age'].std()

#replace column with each entry's z-score
titanic['age'] = (titanic["age"] - a_mean)/a_std
titanic.head()

   survived  pclass       sex       age  ...  deck  embark_town  alive  alone
0         0       3 -0.737281 -0.530005  ...   NaN  Southampton     no  False
1         1       1  1.354813  0.571430  ...     C    Cherbourg    yes  False
2         1       3  1.354813 -0.254646  ...   NaN  Southampton    yes   True
3         1       1  1.354813  0.364911  ...     C  Southampton    yes  False
4         0       3 -0.737281  0.364911  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

## kNN Functions:

In [ ]:
import numpy

def knn(specimen, data, k):
  data_copy = data.copy()
  data_copy['distance_to_new'] = numpy.sqrt(
    (specimen['petal length']-data['petal length'])**2
    +(specimen['sepal length']-data['sepal length'])**2
    +(specimen['petal width']-data['petal width'])**2
    +(specimen['sepal width']-data['sepal width'])**2)
  
  sorted_data = data_copy.sort_values(['distance_to_new']) 
  return sorted_data.iloc[0:k]['species'].mode()[0]

In [ ]:
import numpy

# weighted kNN
def w_knn(specimen, data, k):
  # calculate the distance
  data_copy = data.copy()
  data_copy['distance_to_new'] = numpy.sqrt(
    (specimen['petal length']-data['petal length'])**2
    +(specimen['sepal length']-data['sepal length'])**2
    +(specimen['petal width']-data['petal width'])**2
    +(specimen['sepal width']-data['sepal width'])**2)
  
  # calculate the weights (remember, the weights are 1/d^2)
  data_copy['weights'] = 1/(data_copy['distance_to_new']**2)

  # find the closest k
  sorted_data = data_copy.sort_values(['weights'], ascending = False) 
  top_k = sorted_data.iloc[0:k]

  # use groupby to sum the weights of each species in the closest k
  sum_of_weights_per_species = top_k.groupby(['species'])['weights'].sum()

  sorted = sum_of_weights_per_species.sort_values(ascending=False)
  return sorted.keys()[0]

## Programming Exercise #2
Normalize the predictor columns of the iris dataset using the Z-score
- Note: you need a way to transform the new reading (the specimen) that you will make the prediction on so that the new one and the training data will all be on the same scale. How can you do that?

Repeat your k-NN prediction code with the normalized data.
- Does the value of k change the predictions?
Compare using k=3, k=5 on each method (normalized and non-normalized).

In [ ]:
data = pandas.read_csv('/content/drive/MyDrive/CS167Spring22/datasets/irisData.csv')

In [ ]:
iris = {}
iris['petal length'] = 5.1
iris['sepal length'] = 7.2
iris['petal width'] = 1.5
iris['sepal width'] = 2.5

print('not normalized knn: ', knn(iris,data, 3))
print('not normalized w_knn: ', w_knn(iris,data, 3))

not normalized knn:  Iris-versicolor
not normalized w_knn:  Iris-versicolor

In [ ]:
# your code goes here
# what are the means and standard deviations for petal_length, petal_width, sepal_length, sepal_width?
pl_mean = data['petal length'].mean()
pl_std = data['petal length'].std()

pw_mean = data['petal width'].mean()
pw_std = data['petal width'].std()

sl_mean = data['sepal length'].mean()
sl_std = data['sepal length'].std()

sw_mean = data['sepal width'].mean()
sw_std = data['sepal width'].std()

In [ ]:


norm_specimen = {}
# update values in norm_specimin
norm_specimen['petal length'] = (5.1 - pl_mean)/pl_std
norm_specimen['petal width'] = (1.5 - pw_mean)/pw_std
norm_specimen['sepal length'] = (7.2 - sl_mean)/sl_std
norm_specimen['sepal width'] = (2.5 - sw_mean)/sw_std


norm_data = data.copy()
# update the columns in norm_data 
norm_data['sepal length'] = (data['sepal length'] - sl_mean)/sl_std
norm_data['sepal width'] = (data['sepal width'] - sw_mean)/sw_std
norm_data['petal width'] = (data['petal width'] - pw_mean)/pw_std
norm_data['petal length'] = (data['petal length'] - pl_mean)/pl_std

print('normalized knn: ', knn(norm_specimen,norm_data, 3))
print('normalized w_knn: ', w_knn(norm_specimen,norm_data, 3))

normalized knn:  Iris-virginica
normalized w_knn:  Iris-virginica